import turtle as t
import numpy as np
t.shape('turtle')
t.speed(4)
t.color('blue')
t.width(2)
n = 30

#Списки движений для рисования цифр. Первое число в каждом кортеже - число шагов вперед, второе - поворот направо в градусах
n0 = [(0, 90), (2*n, 90), (n, 90), (2*n, 90), (n, 0), (1.5*n, 0), (0, 0)]    #последние 2 кортежа выполняются с поднятым пером для перехода к следующей цифре
n1 = [(0, 135), (n*np.sqrt(2), 180), (n*np.sqrt(2), 135), (2*n, 270), (1.5*n, 270), (2*n, 90)]
n2 = [(0, 180), (n, 180), (n, 90), (n, 45), (n*np.sqrt(2), 225), (n, 0), (1.5*n, 270), (2*n, 90)]
n3 = [(0, 180), (n, 180), (n, 135), (n*np.sqrt(2), 225), (n, 135), (n*np.sqrt(2), 225), (2.5*n, 270), (2*n, 90)]
n4 = [(0, 90), (2*n, 180), (n, 270), (n, 90), (n, 90), (2.5*n, 0), (0, 0)]
n5 = [(0, 180), (n, 270), (n, 270), (n, 90), (n, 90), (n, 180), (2.5*n, 270), (2*n, 90)]
n6 = [(0, 135), (n*np.sqrt(2), 225), (n, 90), (n, 90), (n, 90), (n, 90), (2.5*n, 270), (n, 90)]
n7 = [(0, 180), (n, 180), (n, 135), (n*np.sqrt(2), 315), (n, 270), (2.5*n, 270), (2*n, 90)]
n8 = [(0, 90), (2*n, 90), (n, 90), (2*n, 90), (n, 90), (n, 90), (n, 180), (2.5*n, 270), (n, 90)]
n9 = [(0, 180), (n, 270), (n, 270), (n, 270), (n, 180), (n, 45), (n*np.sqrt(2), 225), (2.5*n, 270), (2*n, 90)]

#опишем универсальную функцию для рисования произвольной цифры по ее списку движений
def number(n):
    for forward, right in n[0:-2]:                  #поэлементно итерируем срез списка с элемента n[0] включая по элемент n[-2] не включая со стандартным шагом 1
        t.forward(forward)
        t.right(right)
    forward_2, right_2 = n[-2]
    forward_1, right_1 = n[-1]
    t.penup()
    t.forward(forward_2)
    t.right(right_2)
    t.forward(forward_1)
    t.right(right_1)
    t.pendown()

t.penup()
t.goto(-150, 30)
t.pendown()

dict = {0: n0, 1: n1, 2: n2, 3: n3, 4: n4, 5: n5, 6: n6, 7: n7, 8: n8, 9: n9}   #создадим словарь, который по ключу возвращает соответствующий элемент

#опишем функцию, рисующую цифры, указанные в параметре(параметр задаем списком цифр)
def index(numbers):
    for i in numbers:
        number(dict[i])

index([1, 5, 5, 2, 0, 1])